# FabricationPartOptimizeInvalidConnection Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPFabricationFailures..::..FabricationPartOptimizeInvalidConnection Property
BuiltInFailures..::..MEPFabricationFailures Class See Also
---
No available couplings to connect standard lengths for this instance of straight.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FabricationPartOptimizeInvalidConnection { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationPartOptimizeInvalidConnection As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FabricationPartOptimizeInvalidConnection {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPFabricationFailures Class
Autodesk.Revit.DB Namespace